TexasInstruments/c2000ware-core-sdk/driverlib/f28p55x/driverlib/inc/hw_mcanss.h
#define MCAN_ECC_AGGR_REVISION                       (MCAN_ERROR_REGS + 0x00U)
#define MCAN_ECC_AGGR_VECTOR                         (MCAN_ERROR_REGS + 0x08U)
#define MCAN_ECC_AGGR_MISC_STATUS                    (MCAN_ERROR_REGS + 0x0cU)
#define MCAN_ECC_AGGR_WRAP_REVISION                  (MCAN_ERROR_REGS + 0x10U)
#define MCAN_ECC_AGGR_CONTROL                        (MCAN_ERROR_REGS + 0x14U)
#define MCAN_ECC_AGGR_ERROR_CTRL1                    (MCAN_ERROR_REGS + 0x18U)
#define MCAN_ECC_AGGR_ERROR_CTRL2                    (MCAN_ERROR_REGS + 0x1cU)
#define MCAN_ECC_AGGR_ERROR_STATUS1                  (MCAN_ERROR_REGS + 0x20U)
#define MCAN_ECC_AGGR_ERROR_STATUS2                  (MCAN_ERROR_REGS + 0x24U)
#define MCAN_ECC_AGGR_ERROR_STATUS3                  (MCAN_ERROR_REGS + 0x28U)
#define MCAN_ECC_AGGR_SEC_EOI_REG                    (MCAN_ERROR_REGS + 0x3cU)
#define MCAN_ECC_AGGR_SEC_STATUS_REG0                (MCAN_ERROR_REGS + 0x40U)
#define MCAN_ECC_AGGR_SEC_ENABLE_SET_REG0            (MCAN_ERROR_REGS + 0x80U)
#define MCAN_ECC_AGGR_SEC_ENABLE_CLR_REG0            (MCAN_ERROR_REGS + 0xc0U)
#define MCAN_ECC_AGGR_DED_EOI_REG                    (MCAN_ERROR_REGS + 0x13cU)
#define MCAN_ECC_AGGR_DED_STATUS_REG0                (MCAN_ERROR_REGS + 0x140U)
#define MCAN_ECC_AGGR_DED_ENABLE_SET_REG0            (MCAN_ERROR_REGS + 0x180U)
#define MCAN_ECC_AGGR_DED_ENABLE_CLR_REG0            (MCAN_ERROR_REGS + 0x1c0U)

#define MCAN_ECC_AGGR_ENABLE_SET                     (MCAN_ERROR_REGS + 0x200U)
#define MCAN_ECC_AGGR_ENABLE_CLR                     (MCAN_ERROR_REGS + 0x204U)
#define MCAN_ECC_AGGR_STATUS_SET                     (MCAN_ERROR_REGS + 0x208U)
#define MCAN_ECC_AGGR_STATUS_CLR                     (MCAN_ERROR_REGS + 0x20CU)


/****************************************************************************************************
* Field Definition Macros
****************************************************************************************************/

#define MCAN_MCANSS_PID_MINOR_SHIFT                        (0U)
#define MCAN_MCANSS_PID_MINOR_MASK                         (0x0000003fU)

#define MCAN_MCANSS_PID_CUSTOM_SHIFT                       (6U)
#define MCAN_MCANSS_PID_CUSTOM_MASK                        (0x000000c0U)

#define MCAN_MCANSS_PID_MAJOR_SHIFT                        (8U)
#define MCAN_MCANSS_PID_MAJOR_MASK                         (0x00000700U)

#define MCAN_MCANSS_PID_RTL_SHIFT                          (11U)
#define MCAN_MCANSS_PID_RTL_MASK                           (0x0000f800U)

#define MCAN_MCANSS_PID_MODULE_ID_SHIFT                    (16U)
#define MCAN_MCANSS_PID_MODULE_ID_MASK                     (0x0fff0000U)

#define MCAN_MCANSS_PID_BU_SHIFT                           (28U)
#define MCAN_MCANSS_PID_BU_MASK                            (0x30000000U)

#define MCAN_MCANSS_PID_SCHEME_SHIFT                       (30U)
#define MCAN_MCANSS_PID_SCHEME_MASK                        (0xc0000000U)

#define MCAN_MCANSS_CTRL_EMUEN_SHIFT                       (3U)
#define MCAN_MCANSS_CTRL_EMUEN_MASK                        (0x00000008U)

#define MCAN_MCANSS_CTRL_WAKEUPREQEN_SHIFT                 (4U)
#define MCAN_MCANSS_CTRL_WAKEUPREQEN_MASK                  (0x00000010U)

#define MCAN_MCANSS_CTRL_AUTOWAKEUP_SHIFT                  (5U)
#define MCAN_MCANSS_CTRL_AUTOWAKEUP_MASK                   (0x00000020U)

#define MCAN_MCANSS_CTRL_EXT_TS_CNTR_EN_SHIFT              (6U)
#define MCAN_MCANSS_CTRL_EXT_TS_CNTR_EN_MASK               (0x00000040U)

#define MCAN_MCANSS_STAT_RESET_SHIFT                       (0U)
#define MCAN_MCANSS_STAT_RESET_MASK                        (0x00000001U)

#define MCAN_MCANSS_STAT_MEM_INIT_DONE_SHIFT               (1U)
#define MCAN_MCANSS_STAT_MEM_INIT_DONE_MASK                (0x00000002U)

#define MCAN_MCANSS_STAT_ENABLE_FDOE_SHIFT                 (2U)
#define MCAN_MCANSS_STAT_ENABLE_FDOE_MASK                  (0x00000004U)

#define MCAN_MCANSS_ICS_EXT_TS_CNTR_OVFL_SHIFT             (0U)
#define MCAN_MCANSS_ICS_EXT_TS_CNTR_OVFL_MASK              (0x00000001U)

#define MCAN_MCANSS_IRS_EXT_TS_CNTR_OVFL_SHIFT             (0U)
#define MCAN_MCANSS_IRS_EXT_TS_CNTR_OVFL_MASK              (0x00000001U)

#define MCAN_MCANSS_IECS_EXT_TS_CNTR_OVFL_SHIFT            (0U)
#define MCAN_MCANSS_IECS_EXT_TS_CNTR_OVFL_MASK             (0x00000001U)

#define MCAN_MCANSS_IE_EXT_TS_CNTR_OVFL_SHIFT              (0U)
#define MCAN_MCANSS_IE_EXT_TS_CNTR_OVFL_MASK               (0x00000001U)

#define MCAN_MCANSS_IES_EXT_TS_CNTR_OVFL_SHIFT             (0U)
#define MCAN_MCANSS_IES_EXT_TS_CNTR_OVFL_MASK              (0x00000001U)

#define MCAN_MCANSS_EOI_SHIFT                              (0U)
#define MCAN_MCANSS_EOI_MASK                               (0x000000ffU)

#define MCAN_MCANSS_EXT_TS_PRESCALER_SHIFT                 (0U)
#define MCAN_MCANSS_EXT_TS_PRESCALER_MASK                  (0x00ffffffU)

#define MCAN_MCANSS_EXT_TS_UNSERVICED_INTR_CNTR_SHIFT      (0U)
#define MCAN_MCANSS_EXT_TS_UNSERVICED_INTR_CNTR_MASK       (0x0000001fU)

#define MCAN_ECC_EOI_SHIFT                                 (8U)
#define MCAN_ECC_EOI_MASK                                  (0x00000100U)

#define MCAN_CREL_DAY_SHIFT                                (0U)
#define MCAN_CREL_DAY_MASK                                 (0x000000ffU)

#define MCAN_CREL_MON_SHIFT                                (8U)
#define MCAN_CREL_MON_MASK                                 (0x0000ff00U)

#define MCAN_CREL_YEAR_SHIFT                               (16U)
#define MCAN_CREL_YEAR_MASK                                (0x000f0000U)

#define MCAN_CREL_SUBSTEP_SHIFT                            (20U)
#define MCAN_CREL_SUBSTEP_MASK                             (0x00f00000U)

#define MCAN_CREL_STEP_SHIFT                               (24U)
#define MCAN_CREL_STEP_MASK                                (0x0f000000U)

#define MCAN_CREL_REL_SHIFT                                (28U)
#define MCAN_CREL_REL_MASK                                 (0xf0000000U)

#define MCAN_ENDN_ETV_SHIFT                                (0U)
#define MCAN_ENDN_ETV_MASK                                 (0xffffffffU)

#define MCAN_DBTP_DSJW_SHIFT                               (0U)
#define MCAN_DBTP_DSJW_MASK                                (0x0000000fU)

#define MCAN_DBTP_DTSEG2_SHIFT                             (4U)
#define MCAN_DBTP_DTSEG2_MASK                              (0x000000f0U)

#define MCAN_DBTP_DTSEG1_SHIFT                             (8U)
#define MCAN_DBTP_DTSEG1_MASK                              (0x00001f00U)

#define MCAN_DBTP_DBRP_SHIFT                               (16U)
#define MCAN_DBTP_DBRP_MASK                                (0x001f0000U)

#define MCAN_DBTP_TDC_SHIFT                                (23U)
#define MCAN_DBTP_TDC_MASK                                 (0x00800000U)

