TexasInstruments/c2000ware-core-sdk/driverlib/f28p55x/driverlib/inc/hw_mcanss.h
#define MCAN_TXBCIE_CFIE16_SHIFT                           (16U)
#define MCAN_TXBCIE_CFIE16_MASK                            (0x00010000U)

#define MCAN_TXBCIE_CFIE17_SHIFT                           (17U)
#define MCAN_TXBCIE_CFIE17_MASK                            (0x00020000U)

#define MCAN_TXBCIE_CFIE18_SHIFT                           (18U)
#define MCAN_TXBCIE_CFIE18_MASK                            (0x00040000U)

#define MCAN_TXBCIE_CFIE19_SHIFT                           (19U)
#define MCAN_TXBCIE_CFIE19_MASK                            (0x00080000U)

#define MCAN_TXBCIE_CFIE20_SHIFT                           (20U)
#define MCAN_TXBCIE_CFIE20_MASK                            (0x00100000U)

#define MCAN_TXBCIE_CFIE21_SHIFT                           (21U)
#define MCAN_TXBCIE_CFIE21_MASK                            (0x00200000U)

#define MCAN_TXBCIE_CFIE22_SHIFT                           (22U)
#define MCAN_TXBCIE_CFIE22_MASK                            (0x00400000U)

#define MCAN_TXBCIE_CFIE23_SHIFT                           (23U)
#define MCAN_TXBCIE_CFIE23_MASK                            (0x00800000U)

#define MCAN_TXBCIE_CFIE24_SHIFT                           (24U)
#define MCAN_TXBCIE_CFIE24_MASK                            (0x01000000U)

#define MCAN_TXBCIE_CFIE25_SHIFT                           (25U)
#define MCAN_TXBCIE_CFIE25_MASK                            (0x02000000U)

#define MCAN_TXBCIE_CFIE26_SHIFT                           (26U)
#define MCAN_TXBCIE_CFIE26_MASK                            (0x04000000U)

#define MCAN_TXBCIE_CFIE27_SHIFT                           (27U)
#define MCAN_TXBCIE_CFIE27_MASK                            (0x08000000U)

#define MCAN_TXBCIE_CFIE28_SHIFT                           (28U)
#define MCAN_TXBCIE_CFIE28_MASK                            (0x10000000U)

#define MCAN_TXBCIE_CFIE29_SHIFT                           (29U)
#define MCAN_TXBCIE_CFIE29_MASK                            (0x20000000U)

#define MCAN_TXBCIE_CFIE30_SHIFT                           (30U)
#define MCAN_TXBCIE_CFIE30_MASK                            (0x40000000U)

#define MCAN_TXBCIE_CFIE31_SHIFT                           (31U)
#define MCAN_TXBCIE_CFIE31_MASK                            (0x80000000U)

#define MCAN_TXEFC_EFSA_SHIFT                              (2U)
#define MCAN_TXEFC_EFSA_MASK                               (0x0000fffcU)

#define MCAN_TXEFC_EFS_SHIFT                               (16U)
#define MCAN_TXEFC_EFS_MASK                                (0x003f0000U)

#define MCAN_TXEFC_EFWM_SHIFT                              (24U)
#define MCAN_TXEFC_EFWM_MASK                               (0x3f000000U)

#define MCAN_TXEFS_EFFL_SHIFT                              (0U)
#define MCAN_TXEFS_EFFL_MASK                               (0x0000003fU)

#define MCAN_TXEFS_EFGI_SHIFT                              (8U)
#define MCAN_TXEFS_EFGI_MASK                               (0x00001f00U)

#define MCAN_TXEFS_EFPI_SHIFT                              (16U)
#define MCAN_TXEFS_EFPI_MASK                               (0x001f0000U)

#define MCAN_TXEFS_EFF_SHIFT                               (24U)
#define MCAN_TXEFS_EFF_MASK                                (0x01000000U)

#define MCAN_TXEFS_TEFL_SHIFT                              (25U)
#define MCAN_TXEFS_TEFL_MASK                               (0x02000000U)

#define MCAN_TXEFA_EFAI_SHIFT                              (0U)
#define MCAN_TXEFA_EFAI_MASK                               (0x0000001fU)

#define MCAN_ECC_AGGR_REVISION_SCHEME_SHIFT                    (30U)
#define MCAN_ECC_AGGR_REVISION_SCHEME_MASK                     (0xc0000000U)

#define MCAN_ECC_AGGR_REVISION_BU_SHIFT                        (28U)
#define MCAN_ECC_AGGR_REVISION_BU_MASK                         (0x30000000U)

#define MCAN_ECC_AGGR_REVISION_MODULE_ID_SHIFT                 (16U)
#define MCAN_ECC_AGGR_REVISION_MODULE_ID_MASK                  (0x0fff0000U)

#define MCAN_ECC_AGGR_REVISION_REVRTL_SHIFT                    (11U)
#define MCAN_ECC_AGGR_REVISION_REVRTL_MASK                     (0x0000f800U)

#define MCAN_ECC_AGGR_REVISION_REVMAJ_SHIFT                    (8U)
#define MCAN_ECC_AGGR_REVISION_REVMAJ_MASK                     (0x00000700U)

#define MCAN_ECC_AGGR_REVISION_CUSTOM_SHIFT                    (6U)
#define MCAN_ECC_AGGR_REVISION_CUSTOM_MASK                     (0x000000c0U)

#define MCAN_ECC_AGGR_REVISION_REVMIN_SHIFT                    (0U)
#define MCAN_ECC_AGGR_REVISION_REVMIN_MASK                     (0x0000003fU)

#define MCAN_ECC_AGGR_VECTOR_SHIFT                              (0U)
#define MCAN_ECC_AGGR_VECTOR_MASK                               (0x000007ffU)

#define MCAN_ECC_AGGR_VECTOR_RD_SVBUS_SHIFT                     (15U)
#define MCAN_ECC_AGGR_VECTOR_RD_SVBUS_MASK                      (0x00008000U)

#define MCAN_ECC_AGGR_VECTOR_RD_SVBUS_ADDRESS_SHIFT             (16U)
#define MCAN_ECC_AGGR_VECTOR_RD_SVBUS_ADDRESS_MASK              (0x00ff0000U)

#define MCAN_ECC_AGGR_VECTOR_RD_SVBUS_DONE_SHIFT                (24U)
#define MCAN_ECC_AGGR_VECTOR_RD_SVBUS_DONE_MASK                 (0x01000000U)

#define MCAN_ECC_AGGR_MISC_STATUS_NUM_RAMS_SHIFT                    (0U)
#define MCAN_ECC_AGGR_MISC_STATUS_NUM_RAMS_MASK                     (0x000007ffU)

#define MCAN_ECC_AGGR_WRAP_REVISION_SCHEME_SHIFT                (30U)
#define MCAN_ECC_AGGR_WRAP_REVISION_SCHEME_MASK                 (0xc0000000U)

#define MCAN_ECC_AGGR_WRAP_REVISION_BU_SHIFT                    (28U)
#define MCAN_ECC_AGGR_WRAP_REVISION_BU_MASK                     (0x30000000U)

#define MCAN_ECC_AGGR_WRAP_REVISION_MODULE_ID_SHIFT             (16U)
#define MCAN_ECC_AGGR_WRAP_REVISION_MODULE_ID_MASK              (0x0fff0000U)

#define MCAN_ECC_AGGR_WRAP_REVISION_REVRTL_SHIFT                (11U)
#define MCAN_ECC_AGGR_WRAP_REVISION_REVRTL_MASK                 (0x0000f800U)

#define MCAN_ECC_AGGR_WRAP_REVISION_REVMAJ_SHIFT                (8U)
#define MCAN_ECC_AGGR_WRAP_REVISION_REVMAJ_MASK                 (0x00000700U)

#define MCAN_ECC_AGGR_WRAP_REVISION_CUSTOM_SHIFT                (6U)
#define MCAN_ECC_AGGR_WRAP_REVISION_CUSTOM_MASK                 (0x000000c0U)

